tap "clintmod/formulas"
tap "warrensbox/tap"
brew "adr-tools"
brew "age"
brew "atuin"
brew "node"
brew "aws-cdk"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cargo-binstall"
brew "ccat"
brew "chezmoi"
brew "cmake"
brew "cookiecutter"
brew "cosign"
brew "cryptography"
brew "difftastic"
brew "exa"
brew "exiftool"
brew "fd"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "git-gui"
brew "git-remote-codecommit"
brew "git-secrets"
brew "gitleaks"
brew "glow"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "graphql-cli"
brew "htop"
brew "hub"
brew "jq"
brew "k9s"
brew "kondo"
brew "kubecolor"
brew "kubernetes-cli"
brew "libxml2"
brew "llm"
brew "localstack"
brew "mas"
brew "miller"
brew "python@3.11"
brew "mitmproxy"
brew "moor"
brew "nvm"
brew "openvpn"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "pop"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.12"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "snap"
brew "snapcraft"
brew "sops"
brew "starship"
brew "stern"
brew "tcl-tk"
brew "tenv"
brew "tfenv"
brew "thefuck"
brew "tree"
brew "virtualenv"
brew "wget"
brew "zoxide"
cask "1password"
cask "aws-vault-binary"
cask "claude"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "joplin"
cask "mactex"
cask "mitmproxy"
cask "ngrok"
cask "onedrive"
cask "orbstack"
cask "postman"
cask "rancher"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "zoom"
mas "Bitwarden", id: 1352778147
mas "Copilot", id: 6738511300
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
vscode "amazonwebservices-aisolutionsarchitecture.bedrock-vscode-playground"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "firsttris.vscode-jest-runner"
vscode "foam.foam-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "pomdtr.excalidraw-editor"
vscode "prompt-flow.prompt-flow"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vxplain.vxplain"
vscode "wholroyd.jinja"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/chrishrb/go-grip"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "golang.org/x/tools/cmd/guru"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/keyify"
go "github.com/grafana/mcp-grafana/cmd/mcp-grafana"
go "github.com/fatih/motion"
go "github.com/justjanne/powerline-go"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
