tap "clintmod/formulas"
tap "common-fate/granted"
tap "deskflow/tap"
tap "kubecolor/tap"
tap "oven-sh/bun"
tap "turbot/tap"
tap "warrensbox/tap"
brew "act"
brew "adr-tools"
brew "age"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "icu4c@78"
brew "libxml2"
brew "node"
brew "appium"
brew "atuin"
brew "aws-cdk"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cargo-binstall"
brew "ccat"
brew "chezmoi"
brew "cmake"
brew "cookiecutter"
brew "cosign"
brew "cryptography"
brew "difftastic"
brew "direnv"
brew "docker"
brew "docutils"
brew "duti"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fswatch"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "tcl-tk"
brew "git-gui"
brew "git-remote-codecommit"
brew "git-secrets"
brew "gitleaks"
brew "glow"
brew "go"
brew "graphql-cli"
brew "htop"
brew "hub"
brew "jq"
brew "k6"
brew "k9s"
brew "kondo"
brew "kubernetes-cli"
brew "llm"
brew "localstack"
brew "mas"
brew "miller"
brew "mise"
brew "moor"
brew "nvm"
brew "ollama"
brew "openvpn"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "pop"
brew "pre-commit"
brew "pulumi"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "snap"
brew "snapcraft"
brew "sops"
brew "starship"
brew "stern"
brew "stow"
brew "tenv", link: false
brew "tfenv"
brew "thefuck"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "uv"
brew "virtualenv"
brew "wget"
brew "xcodegen"
brew "yq"
brew "zoxide"
brew "common-fate/granted/granted"
brew "kubecolor/tap/kubecolor"
brew "oven-sh/bun/bun"
cask "1password"
cask "antigravity"
cask "aws-vault-binary"
cask "bitwarden"
cask "claude"
cask "deskflow/tap/deskflow-dev"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "joplin"
cask "keka"
cask "loom"
cask "mitmproxy"
cask "ngrok"
cask "obsidian"
cask "openvpn-connect"
cask "postman"
cask "rancher"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
mas "GarageBand", id: 682658836
mas "HP", id: 1474276998
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices-aisolutionsarchitecture.bedrock-vscode-playground"
vscode "anthropic.claude-code"
vscode "austenc.tailwind-docs"
vscode "avetis.tokyo-night"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bourhaouta.tailwindshades"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "k6.k6"
vscode "kevinrose.vsc-python-indent"
vscode "keyring.lua"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "prompt-flow.prompt-flow"
vscode "rb905.vscode-aws-vault"
vscode "redhat.vscode-yaml"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vxplain.vxplain"
vscode "wholroyd.jinja"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/chrishrb/go-grip"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "golang.org/x/tools/cmd/guru"
go "github.com/lancehunt/ideas/cmd/ideas"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/grafana/mcp-grafana/cmd/mcp-grafana"
go "github.com/fatih/motion"
go "github.com/justjanne/powerline-go"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "claudelytics"
cargo "mergiraf"
uv "aider-chat", with: ["pip"]
uv "it2"
uv "specify-cli"
